/*
 * Створити моделі для зберагання даних
 * про студентів та їх оцінки
 * 
 * Створіть контекст бази даних та налаштуйте його для роботи з SQL Server
 * 
 * Створіть міграцію для створення таблиць у базі даних
 * 
 * Додайте моделі для зберігання інформації про курси, які відвідують студенти
 * 
 * Додайте зв'язок між оцінками та курсами, щоб можна було відстежувати, які оцінки отримали студенти за кожен курс
 * 
 * Створіть міграцію для застосування цих змін до бази даних
 * 
 * 
 * 
 */

using Microsoft.EntityFrameworkCore;
using StudentsGradesCoursesEF.Models;

using var context = new StudentsContext();

//add-migration StudentsAndGrades
